       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PGM PIC X(8) VALUE 'SUB2'.
       01  AMOUNT PIC S9(5) COMP-3 VALUE 42.
       01  RESULT PIC S9(9) COMP.
       PROCEDURE DIVISION.
       MAIN.
           CALL 'SUB1' USING AMOUNT BY CONTENT 'ABC' BY VALUE RESULT
               ON EXCEPTION DISPLAY 'NO SUB1'
           END-CALL.
           CALL PGM USING BY REFERENCE AMOUNT RETURNING RESULT.
           CANCEL PGM.
           GOBACK.
