       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO INDD
               FILE STATUS IS IN-STATUS.
           SELECT OUT-FILE ASSIGN TO OUTDD.
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE.
       01  IN-REC PIC X(80).
       FD  OUT-FILE.
       01  OUT-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01  IN-STATUS PIC XX.
       01  EOF-FLAG PIC X VALUE 'N'.
       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT IN-FILE OUTPUT OUT-FILE.
           READ IN-FILE
               AT END MOVE 'Y' TO EOF-FLAG
           END-READ.
           WRITE OUT-REC FROM IN-REC AFTER ADVANCING 2 LINES.
           CLOSE IN-FILE OUT-FILE.
           GOBACK.
