       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQLWHEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SQLCODE PIC S9(9) COMP.
       01  CUST-ID PIC S9(9) COMP.
       01  CUST-NAME PIC X(20).
       PROCEDURE DIVISION.
       MAIN.
           EXEC SQL WHENEVER SQLERROR GO TO FAILED END-EXEC.
           EXEC SQL SELECT NAME INTO :CUST-NAME FROM CUST
               WHERE ID = :CUST-ID
           END-EXEC.
           DISPLAY CUST-NAME.
           GOBACK.
       FAILED.
           DISPLAY 'SQLCODE ' SQLCODE.
           GOBACK.
