       IDENTIFICATION DIVISION.
       PROGRAM-ID. KSDS01.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUST ASSIGN TO CUSTDD ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC RECORD KEY IS C-ID
               ALTERNATE RECORD KEY IS C-CITY WITH DUPLICATES
               FILE STATUS IS FS.
           SELECT REL ASSIGN TO RELDD ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM RELATIVE KEY IS RK.
       DATA DIVISION.
       FILE SECTION.
       FD  CUST.
       01  C-REC.
           05 C-ID PIC X(3).
           05 C-CITY PIC X(4).
       FD  REL.
       01  R-REC PIC X(4).
       WORKING-STORAGE SECTION.
       01  FS PIC XX.
       01  RK PIC 9(4).
       PROCEDURE DIVISION.
           OPEN I-O CUST REL
           MOVE 'PERT' TO C-CITY
           START CUST KEY IS NOT LESS THAN C-CITY
               INVALID KEY DISPLAY 'NONE'
           END-START
           READ CUST NEXT RECORD AT END CONTINUE END-READ
           REWRITE C-REC INVALID KEY DISPLAY FS END-REWRITE
           MOVE 7 TO RK
           READ REL INVALID KEY CONTINUE END-READ
           DELETE REL RECORD END-DELETE
           CLOSE CUST REL
           GOBACK.
