      * C95: DISPLAY of a numeric literal.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LITERALS.
       PROCEDURE DIVISION.
           DISPLAY 1.5 ' ' -1.50 ' ' .5 ' ' +0.25 ' ' 0.0 ' ' 007
           GOBACK.
